Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/mcspi.h
/* -------- MCSPI_CRCR : (MCSPI Offset: 0x4C) (R/W 32) CRC Register -------- */
#define MCSPI_CRCR_FRL_Pos                    _UINT32_(0)                                          /* (MCSPI_CRCR) Frame Length Position */
#define MCSPI_CRCR_FRL_Msk                    (_UINT32_(0xFF) << MCSPI_CRCR_FRL_Pos)               /* (MCSPI_CRCR) Frame Length Mask */
#define MCSPI_CRCR_FRL(value)                 (MCSPI_CRCR_FRL_Msk & (_UINT32_(value) << MCSPI_CRCR_FRL_Pos)) /* Assigment of value for FRL in the MCSPI_CRCR register */
#define MCSPI_CRCR_CRCS_Pos                   _UINT32_(16)                                         /* (MCSPI_CRCR) CRC Size Position */
#define MCSPI_CRCR_CRCS_Msk                   (_UINT32_(0x1) << MCSPI_CRCR_CRCS_Pos)               /* (MCSPI_CRCR) CRC Size Mask */
#define MCSPI_CRCR_CRCS(value)                (MCSPI_CRCR_CRCS_Msk & (_UINT32_(value) << MCSPI_CRCR_CRCS_Pos)) /* Assigment of value for CRCS in the MCSPI_CRCR register */
#define   MCSPI_CRCR_CRCS_16B_CRC_Val         _UINT32_(0x0)                                        /* (MCSPI_CRCR) CRC size is 16 bits.  */
#define   MCSPI_CRCR_CRCS_32B_CRC_Val         _UINT32_(0x1)                                        /* (MCSPI_CRCR) CRC size is 32 bits.  */
#define MCSPI_CRCR_CRCS_16B_CRC               (MCSPI_CRCR_CRCS_16B_CRC_Val << MCSPI_CRCR_CRCS_Pos) /* (MCSPI_CRCR) CRC size is 16 bits. Position  */
#define MCSPI_CRCR_CRCS_32B_CRC               (MCSPI_CRCR_CRCS_32B_CRC_Val << MCSPI_CRCR_CRCS_Pos) /* (MCSPI_CRCR) CRC size is 32 bits. Position  */
#define MCSPI_CRCR_FRHL_Pos                   _UINT32_(20)                                         /* (MCSPI_CRCR) Frame Header Length Position */
#define MCSPI_CRCR_FRHL_Msk                   (_UINT32_(0xF) << MCSPI_CRCR_FRHL_Pos)               /* (MCSPI_CRCR) Frame Header Length Mask */
#define MCSPI_CRCR_FRHL(value)                (MCSPI_CRCR_FRHL_Msk & (_UINT32_(value) << MCSPI_CRCR_FRHL_Pos)) /* Assigment of value for FRHL in the MCSPI_CRCR register */
#define MCSPI_CRCR_CRM_Pos                    _UINT32_(24)                                         /* (MCSPI_CRCR) Continuous Read Mode Position */
#define MCSPI_CRCR_CRM_Msk                    (_UINT32_(0x1) << MCSPI_CRCR_CRM_Pos)                /* (MCSPI_CRCR) Continuous Read Mode Mask */
#define MCSPI_CRCR_CRM(value)                 (MCSPI_CRCR_CRM_Msk & (_UINT32_(value) << MCSPI_CRCR_CRM_Pos)) /* Assigment of value for CRM in the MCSPI_CRCR register */
#define MCSPI_CRCR_FHE_Pos                    _UINT32_(25)                                         /* (MCSPI_CRCR) Frame Header Excluded Position */
#define MCSPI_CRCR_FHE_Msk                    (_UINT32_(0x1) << MCSPI_CRCR_FHE_Pos)                /* (MCSPI_CRCR) Frame Header Excluded Mask */
#define MCSPI_CRCR_FHE(value)                 (MCSPI_CRCR_FHE_Msk & (_UINT32_(value) << MCSPI_CRCR_FHE_Pos)) /* Assigment of value for FHE in the MCSPI_CRCR register */
#define MCSPI_CRCR_DCRX_Pos                   _UINT32_(26)                                         /* (MCSPI_CRCR) Disable CRC Receiving Position */
#define MCSPI_CRCR_DCRX_Msk                   (_UINT32_(0x1) << MCSPI_CRCR_DCRX_Pos)               /* (MCSPI_CRCR) Disable CRC Receiving Mask */
#define MCSPI_CRCR_DCRX(value)                (MCSPI_CRCR_DCRX_Msk & (_UINT32_(value) << MCSPI_CRCR_DCRX_Pos)) /* Assigment of value for DCRX in the MCSPI_CRCR register */
#define MCSPI_CRCR_DHRX_Pos                   _UINT32_(27)                                         /* (MCSPI_CRCR) Disable Header Receiving Position */
#define MCSPI_CRCR_DHRX_Msk                   (_UINT32_(0x1) << MCSPI_CRCR_DHRX_Pos)               /* (MCSPI_CRCR) Disable Header Receiving Mask */
#define MCSPI_CRCR_DHRX(value)                (MCSPI_CRCR_DHRX_Msk & (_UINT32_(value) << MCSPI_CRCR_DHRX_Pos)) /* Assigment of value for DHRX in the MCSPI_CRCR register */
#define MCSPI_CRCR_Msk                        _UINT32_(0x0FF100FF)                                 /* (MCSPI_CRCR) Register Mask  */


/* -------- MCSPI_TPMR : (MCSPI Offset: 0x50) (R/W 32) Two-Pin Mode Register -------- */
#define MCSPI_TPMR_CSM_Pos                    _UINT32_(0)                                          /* (MCSPI_TPMR) Chip Select Mode Position */
#define MCSPI_TPMR_CSM_Msk                    (_UINT32_(0x1) << MCSPI_TPMR_CSM_Pos)                /* (MCSPI_TPMR) Chip Select Mode Mask */
#define MCSPI_TPMR_CSM(value)                 (MCSPI_TPMR_CSM_Msk & (_UINT32_(value) << MCSPI_TPMR_CSM_Pos)) /* Assigment of value for CSM in the MCSPI_TPMR register */
#define MCSPI_TPMR_MIL_Pos                    _UINT32_(1)                                          /* (MCSPI_TPMR) Multiple Input Lines Position */
#define MCSPI_TPMR_MIL_Msk                    (_UINT32_(0x1) << MCSPI_TPMR_MIL_Pos)                /* (MCSPI_TPMR) Multiple Input Lines Mask */
#define MCSPI_TPMR_MIL(value)                 (MCSPI_TPMR_MIL_Msk & (_UINT32_(value) << MCSPI_TPMR_MIL_Pos)) /* Assigment of value for MIL in the MCSPI_TPMR register */
#define MCSPI_TPMR_OSR_Pos                    _UINT32_(2)                                          /* (MCSPI_TPMR) OverSampling Rate Position */
#define MCSPI_TPMR_OSR_Msk                    (_UINT32_(0x3) << MCSPI_TPMR_OSR_Pos)                /* (MCSPI_TPMR) OverSampling Rate Mask */
#define MCSPI_TPMR_OSR(value)                 (MCSPI_TPMR_OSR_Msk & (_UINT32_(value) << MCSPI_TPMR_OSR_Pos)) /* Assigment of value for OSR in the MCSPI_TPMR register */
#define MCSPI_TPMR_Msk                        _UINT32_(0x0000000F)                                 /* (MCSPI_TPMR) Register Mask  */


/* -------- MCSPI_TPHR : (MCSPI Offset: 0x54) ( R/ 32) Two-Pin Header Register -------- */
#define MCSPI_TPHR_CNT_Pos                    _UINT32_(0)                                          /* (MCSPI_TPHR) Frame Counter Position */
#define MCSPI_TPHR_CNT_Msk                    (_UINT32_(0x3) << MCSPI_TPHR_CNT_Pos)                /* (MCSPI_TPHR) Frame Counter Mask */
#define MCSPI_TPHR_CNT(value)                 (MCSPI_TPHR_CNT_Msk & (_UINT32_(value) << MCSPI_TPHR_CNT_Pos)) /* Assigment of value for CNT in the MCSPI_TPHR register */
#define MCSPI_TPHR_BOOST_Pos                  _UINT32_(2)                                          /* (MCSPI_TPHR) Current Boost Position */
#define MCSPI_TPHR_BOOST_Msk                  (_UINT32_(0x1) << MCSPI_TPHR_BOOST_Pos)              /* (MCSPI_TPHR) Current Boost Mask */
#define MCSPI_TPHR_BOOST(value)               (MCSPI_TPHR_BOOST_Msk & (_UINT32_(value) << MCSPI_TPHR_BOOST_Pos)) /* Assigment of value for BOOST in the MCSPI_TPHR register */
#define MCSPI_TPHR_GAIN_Pos                   _UINT32_(3)                                          /* (MCSPI_TPHR) Gain Position */
#define MCSPI_TPHR_GAIN_Msk                   (_UINT32_(0x3) << MCSPI_TPHR_GAIN_Pos)               /* (MCSPI_TPHR) Gain Mask */
#define MCSPI_TPHR_GAIN(value)                (MCSPI_TPHR_GAIN_Msk & (_UINT32_(value) << MCSPI_TPHR_GAIN_Pos)) /* Assigment of value for GAIN in the MCSPI_TPHR register */
#define MCSPI_TPHR_OSR_Pos                    _UINT32_(5)                                          /* (MCSPI_TPHR) OverSampling Rate Position */
#define MCSPI_TPHR_OSR_Msk                    (_UINT32_(0x3) << MCSPI_TPHR_OSR_Pos)                /* (MCSPI_TPHR) OverSampling Rate Mask */
#define MCSPI_TPHR_OSR(value)                 (MCSPI_TPHR_OSR_Msk & (_UINT32_(value) << MCSPI_TPHR_OSR_Pos)) /* Assigment of value for OSR in the MCSPI_TPHR register */
#define MCSPI_TPHR_Msk                        _UINT32_(0x0000007F)                                 /* (MCSPI_TPHR) Register Mask  */


/* -------- MCSPI_WPMR : (MCSPI Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define MCSPI_WPMR_WPEN_Pos                   _UINT32_(0)                                          /* (MCSPI_WPMR) Write Protection Enable Position */
#define MCSPI_WPMR_WPEN_Msk                   (_UINT32_(0x1) << MCSPI_WPMR_WPEN_Pos)               /* (MCSPI_WPMR) Write Protection Enable Mask */
#define MCSPI_WPMR_WPEN(value)                (MCSPI_WPMR_WPEN_Msk & (_UINT32_(value) << MCSPI_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the MCSPI_WPMR register */
#define MCSPI_WPMR_WPITEN_Pos                 _UINT32_(1)                                          /* (MCSPI_WPMR) Write Protection Interrupt Enable Position */
#define MCSPI_WPMR_WPITEN_Msk                 (_UINT32_(0x1) << MCSPI_WPMR_WPITEN_Pos)             /* (MCSPI_WPMR) Write Protection Interrupt Enable Mask */
#define MCSPI_WPMR_WPITEN(value)              (MCSPI_WPMR_WPITEN_Msk & (_UINT32_(value) << MCSPI_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the MCSPI_WPMR register */
#define MCSPI_WPMR_WPCREN_Pos                 _UINT32_(2)                                          /* (MCSPI_WPMR) Write Protection Control Register Enable Position */
#define MCSPI_WPMR_WPCREN_Msk                 (_UINT32_(0x1) << MCSPI_WPMR_WPCREN_Pos)             /* (MCSPI_WPMR) Write Protection Control Register Enable Mask */
#define MCSPI_WPMR_WPCREN(value)              (MCSPI_WPMR_WPCREN_Msk & (_UINT32_(value) << MCSPI_WPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the MCSPI_WPMR register */
#define MCSPI_WPMR_WPKEY_Pos                  _UINT32_(8)                                          /* (MCSPI_WPMR) Write Protection Key Position */
#define MCSPI_WPMR_WPKEY_Msk                  (_UINT32_(0xFFFFFF) << MCSPI_WPMR_WPKEY_Pos)         /* (MCSPI_WPMR) Write Protection Key Mask */
#define MCSPI_WPMR_WPKEY(value)               (MCSPI_WPMR_WPKEY_Msk & (_UINT32_(value) << MCSPI_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the MCSPI_WPMR register */
#define   MCSPI_WPMR_WPKEY_PASSWD_Val         _UINT32_(0x535049)                                   /* (MCSPI_WPMR) Writing any other value in this field aborts the write operation of WPEN. Always reads as 0.  */
#define MCSPI_WPMR_WPKEY_PASSWD               (MCSPI_WPMR_WPKEY_PASSWD_Val << MCSPI_WPMR_WPKEY_Pos) /* (MCSPI_WPMR) Writing any other value in this field aborts the write operation of WPEN. Always reads as 0. Position  */
#define MCSPI_WPMR_Msk                        _UINT32_(0xFFFFFF07)                                 /* (MCSPI_WPMR) Register Mask  */


/* -------- MCSPI_WPSR : (MCSPI Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define MCSPI_WPSR_WPVS_Pos                   _UINT32_(0)                                          /* (MCSPI_WPSR) Write Protection Violation Status Position */
#define MCSPI_WPSR_WPVS_Msk                   (_UINT32_(0x1) << MCSPI_WPSR_WPVS_Pos)               /* (MCSPI_WPSR) Write Protection Violation Status Mask */
#define MCSPI_WPSR_WPVS(value)                (MCSPI_WPSR_WPVS_Msk & (_UINT32_(value) << MCSPI_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the MCSPI_WPSR register */
#define MCSPI_WPSR_WPVSRC_Pos                 _UINT32_(8)                                          /* (MCSPI_WPSR) Write Protection Violation Source Position */
#define MCSPI_WPSR_WPVSRC_Msk                 (_UINT32_(0xFF) << MCSPI_WPSR_WPVSRC_Pos)            /* (MCSPI_WPSR) Write Protection Violation Source Mask */
#define MCSPI_WPSR_WPVSRC(value)              (MCSPI_WPSR_WPVSRC_Msk & (_UINT32_(value) << MCSPI_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the MCSPI_WPSR register */
#define MCSPI_WPSR_Msk                        _UINT32_(0x0000FF01)                                 /* (MCSPI_WPSR) Register Mask  */


/* -------- MCSPI_RPR : (MCSPI Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define MCSPI_RPR_RXPTR_Pos                   _UINT32_(0)                                          /* (MCSPI_RPR) Receive Pointer Register Position */
#define MCSPI_RPR_RXPTR_Msk                   (_UINT32_(0xFFFFFFFF) << MCSPI_RPR_RXPTR_Pos)        /* (MCSPI_RPR) Receive Pointer Register Mask */
#define MCSPI_RPR_RXPTR(value)                (MCSPI_RPR_RXPTR_Msk & (_UINT32_(value) << MCSPI_RPR_RXPTR_Pos)) /* Assigment of value for RXPTR in the MCSPI_RPR register */
#define MCSPI_RPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MCSPI_RPR) Register Mask  */


/* -------- MCSPI_RCR : (MCSPI Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define MCSPI_RCR_RXCTR_Pos                   _UINT32_(0)                                          /* (MCSPI_RCR) Receive Counter Register Position */
#define MCSPI_RCR_RXCTR_Msk                   (_UINT32_(0xFFFF) << MCSPI_RCR_RXCTR_Pos)            /* (MCSPI_RCR) Receive Counter Register Mask */
#define MCSPI_RCR_RXCTR(value)                (MCSPI_RCR_RXCTR_Msk & (_UINT32_(value) << MCSPI_RCR_RXCTR_Pos)) /* Assigment of value for RXCTR in the MCSPI_RCR register */
#define MCSPI_RCR_Msk                         _UINT32_(0x0000FFFF)                                 /* (MCSPI_RCR) Register Mask  */


/* -------- MCSPI_TPR : (MCSPI Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#define MCSPI_TPR_TXPTR_Pos                   _UINT32_(0)                                          /* (MCSPI_TPR) Transmit Counter Register Position */
#define MCSPI_TPR_TXPTR_Msk                   (_UINT32_(0xFFFFFFFF) << MCSPI_TPR_TXPTR_Pos)        /* (MCSPI_TPR) Transmit Counter Register Mask */
#define MCSPI_TPR_TXPTR(value)                (MCSPI_TPR_TXPTR_Msk & (_UINT32_(value) << MCSPI_TPR_TXPTR_Pos)) /* Assigment of value for TXPTR in the MCSPI_TPR register */
#define MCSPI_TPR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (MCSPI_TPR) Register Mask  */


/* -------- MCSPI_TCR : (MCSPI Offset: 0x10C) (R/W 32) Transmit Counter Register -------- */
#define MCSPI_TCR_TXCTR_Pos                   _UINT32_(0)                                          /* (MCSPI_TCR) Transmit Counter Register Position */
#define MCSPI_TCR_TXCTR_Msk                   (_UINT32_(0xFFFF) << MCSPI_TCR_TXCTR_Pos)            /* (MCSPI_TCR) Transmit Counter Register Mask */
#define MCSPI_TCR_TXCTR(value)                (MCSPI_TCR_TXCTR_Msk & (_UINT32_(value) << MCSPI_TCR_TXCTR_Pos)) /* Assigment of value for TXCTR in the MCSPI_TCR register */
#define MCSPI_TCR_Msk                         _UINT32_(0x0000FFFF)                                 /* (MCSPI_TCR) Register Mask  */


